project.org
#+TITLE: My machine configs
#+AUTHOR: Vladimir Timofeenko
#+EMAIL: id@vtimofeenko.com
#+DATE: <2022-11-09 Wed>
#+TAGS: { fix(b) feat(f) doc(d) chore(c) to_think(t) }
#+HEADER-ARGS:nix: :padline no

# TODO Not right now
# #+HUGO_BASE_DIR: ~/Documents/vtimofeenko.com/
# #+HUGO_SECTION: posts
# #+HUGO_LEVEL_OFFSET: 0
# #+HUGO_CODE_FENCE: nil
# #+EXPORT_FILE_NAME: TODO:

* README

#+begin_src md :tangle README.md

This is my set of dotfiles in a single flake. The README contains a high-level description of the outputs and the `project.org` file contains the details and rationalization of implementation.

# Background

I have migrated to using Nix(ideally, NixOS) on all machines that I get my hands on. This repo contains the configurations for the common tools I use across the machines.

Certain components of my config (mostly dealing with passwords and such) are not included in this flake but rather managed through a separate flake called ~private-config~

# Usage

```nix
{
    inputs= {
        monorepo = {
            url = "github:VTimofeenko/monorepo-machine-config";
            inputs = {
                infra.follows = "stub-flake";
                private-config.follows = "stub-flake";
            };
        };
        stub-flake.url = "github:VTimofeenko/stub-flake"; # A completely empty flake
    };
    outputs = inputs@{ ... }:
    {
        # Import modules/overlays from inputs.monorepo. See the rest of README for more details
    };
}
```

# Specific outputs description

## Modules

The flake comes with a `default` module that currently includes:

- [zsh config](#ZSH-module)
- nix-the-package-manager config

It can be imported as

```nix
{
    outputs = inputs@{ ... }:
    {
        nixosConfigurations.machine-name = nixpkgs.lib.nixosSystem {
            # ...
            modules =
            [
                inputs.monorepo.nixosModules.default
            ];
        };
    };
}
```

#+end_src

* Project TOOD stats :noexport:

#+BEGIN: tagblock :todo ("DONE" "CNCL") :caption done :tags ("fix" "feat" "doc" "chore")
#+caption: done
| fix   | 2 |
| feat  | 7 |
| doc   | 1 |
| chore | 9 |
#+END

#+BEGIN: tagblock :todo t :caption todo :tags ("fix" "feat" "doc" "chore")
#+caption: todo
| fix   | 2 |
| feat  | 9 |
| doc   | 2 |
| chore | 6 |
#+END

* Project structure

- `project.org` :: file, from which everything gets tangled
- `hosts/` :: directory where per-machine configs are stored
- `modules/` :: top-level directory to contain all categories of modules

* Intro :noexport:

Boring technical stuff

#+begin_src nix :tangle flake.nix
{
  description = "NixOS configuration by Vladimir Timofeenko";
#+end_src

* Inputs
:PROPERTIES:
:CATEGORY: INPUTS
:END:

#+begin_src nix :tangle flake.nix
  inputs = {
    nixpkgs.url = "nixpkgs/nixos-22.11";
    nixos-hardware.url = "github:NixOS/nixos-hardware/master";
    home-manager.url = "github:rycee/home-manager/release-22.11";
    agenix.url = "github:ryantm/agenix";

    # Theming and stuff
    base16 = {
      url = "github:SenchoPens/base16.nix";
      # One input only
      inputs.nixpkgs.follows = "nixpkgs";
    };

    color_scheme = {
      url = "github:ajlende/base16-atlas-scheme";
      flake = false;
    };
    private-config = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/private-flake.git";
      inputs = {
        agenix.follows = "agenix";
        nixpkgs.follows = "nixpkgs";
      };
    };
    my-tmux = {
      url = "github:VTimofeenko/tmux-flake";
      inputs = {
        nixpkgs.follows = "nixpkgs";
        base16.follows = "base16";
        color_scheme.follows = "color_scheme";
      };
    };

    my-nvim-flake.url = "github:VTimofeenko/nvim-flake";

    my-sway-config = {
      url = "git+file:///home/spacecadet/code/sway-flake?ref=master";
      inputs = {
        base16.follows = "base16";
        color-scheme.follows = "color_scheme";
      };
    };
    # nur.url = "github:nix-community/NUR";
    my-doom-config = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/doom-config.git";
    };
    wg-namespace-flake = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/wireguard-namespace-flake.git";
      inputs.nixpkgs.follows = "nixpkgs";
    };

    infra = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/infra-hosts.git";
      flake = false;
    };

    hyprland.url = "github:hyprwm/Hyprland";

  };
#+end_src

*** CNCL Consider dropping nixos-hardware and merging everything here by hand :chore:
CLOSED: [2022-12-09 Fri 17:25]

*** DONE Make sure all inputs of base16 are tracking other inputs :chore:
CLOSED: [2022-12-12 Mon 19:39]

*** DONE Unify naming scheme (some inputs are called "my-", others - "vt-") :chore:
CLOSED: [2022-12-12 Mon 19:43]

*** DONE Evaluate vt-colors input :to_think:
CLOSED: [2022-12-12 Mon 19:45]

*** DONE Move all path:// inputs to at least git+file, ideally - git+ssh on gitea :chore:
CLOSED: [2022-12-14 Wed 21:54]

* Outputs
:PROPERTIES:
:header-args:nix: :tangle flake.nix
:END:

** Intro
First, the plumbing:

#+begin_src nix
outputs = inputs@{ nixpkgs
                 , nixos-hardware
                 , home-manager
                 , agenix
                 , my-nvim-flake
                 , private-config
                 , my-sway-config
                 , ...
                 }:
#+end_src

I am planning to use the same set of overlays with all my machines:

#+begin_src nix
let
  system = "x86_64-linux";
  pkgs = import nixpkgs {
    inherit system;
    config = { allowUnfree = true; };
    overlays = [
      # nur.overlay
      (final: prev: {
        my_nvim = my-nvim-flake.defaultPackage."${system}";
      })
      my-sway-config.overlays.default
    ];
  };
  commonModulesFromInputs = [
    # Enable secrets management
    agenix.nixosModules.default
    home-manager.nixosModules.home-manager
    inputs.my-tmux.nixosModule
    {
      programs.vt-zsh = {
        starship_enable = true;
        direnv_enable = true;
        gpg_enable = true;
        enableAnyNixShell = true;
      };
    }
    {
      home-manager.users.spacecadet = my-sway-config.nixosModules.default;
    }
    {
      home-manager.users.spacecadet = { ... }: {
        wayland.windowManager.sway.config = {
          # Restore non-vm modifier
          modifier = "Mod4";
          # Output configuration
          output = {
            "eDP-1" = { "scale" = "1"; };
          };
        };
        vt-sway.enableBrightness = true;
      };
    }
    my-sway-config.nixosModules.system
    {
      # Needed, otherwise error
      # error: cannot look up '<nixpkgs>' in pure evaluation mode
      home-manager.useGlobalPkgs = true;
      home-manager.useUserPackages = true;
      home-manager.users.spacecadet.home.stateVersion = "22.05";
    }
    # My emacs module
    {
      home-manager.users.spacecadet = inputs.my-doom-config.nixosModules.default;
    }
    inputs.wg-namespace-flake.nixosModules.default
    private-config.nixosModules.commonNodeModule
  ];

  commonCustomModules = [
    ./modules/applications
    ./modules/common
    ./modules/development
    ./modules/development/cross-compile.nix
    ./modules/development/virtualization.nix
    ./modules/hardware/dygma.nix
    ./modules/hardware/disks.nix
    ./modules/hardware/printer.nix
    ./modules/hardware/scanner.nix
    ./modules/zsh

    # Network
    ./modules/network/common_lan.nix
    ./modules/network/lan-wifi.nix
  ];
  # Function to keep everything similar
  mkMyModules = list: list ++ commonModulesFromInputs ++ commonCustomModules;
in
#+end_src

The outputs are contained in a self-referencing attrset so that I can easily reference objects within the flake (e.g. a host uses a module from flake's nixosModules)

#+begin_src nix
rec {
  nixosConfigurations = {
#+end_src

** Modules

Modules will be divided into categories represented as directories

*** Common -- catch-all

General module that includes all the things:

#+begin_src nix :tangle modules/common/default.nix
{ ... }:
{
  imports = [
    ./nix-config.nix
    ./fonts.nix
    ./user.nix
    ./utils.nix
    ./zsh.nix
  ];
  time.timeZone = "America/Los_Angeles";
  # The global useDHCP flag is deprecated, therefore explicitly set to false here.
  # Per-interface useDHCP will be mandatory in the future, so this generated config
  # replicates the default behaviour.
  networking.useDHCP = false;
}
#+end_src

I am using z shell on all machines where I have some need for an interactive login. The z shell configuration is done in a separate flake (~my-zsh~) which provides the zsh configuration encapsulated in a module.

#+begin_src nix :tangle modules/common/zsh.nix
{ pkgs, ... }:
{
    users.users.root.shell = pkgs.zsh;
}

#+end_src

Some common utilities I find myself using all the time as all users on the system:

#+begin_src nix :tangle modules/common/utils.nix
{ pkgs, ... }:
{
  environment.systemPackages = with pkgs; [
    htop
    curl
    wget
    fd
    inetutils  # for telnet
    ripgrep
    lsof
    dig
    nftables
    unzip
    tcpdump
    jq
  ];
}
#+end_src


***** Nix-the-package-manager config

****** README
#+begin_src md :tangle README.md
### Nix module

The tweaks I use for nix the package manager:

- Enable flakes (mandatory)
- Quickly fail if the network is inaccessible
- Do not nag me if a flake git repo is dirty (has some uncommitted stuff)
- Automatically optimizes `/nix/store` to save a bit of space using hardlinking

#### Installation

To use this module separately from `default` one:

```nix
{
    outputs = inputs@{ ... }:
    {
        nixosConfigurations.machine-name = nixpkgs.lib.nixosSystem {
            # ...
            modules =
            [
                inputs.monorepo.nixosModules.nix-config
            ];
        };
    };
}
```

#+end_src

****** Implementation

#+begin_src nix :tangle modules/common/nix-config.nix
# From https://nixos.wiki/wiki/Flakes
{ pkgs, ... }: {
  # Allow unfree packages across the board
  nixpkgs.config.allowUnfree = true;
  nix = {
    extraOptions = ''
      # Quicker timeout for inaccessible binary caches
      connect-timeout = 5
      # Enable flakes
      experimental-features = nix-command flakes
      # Do not warn on dirty git repo
      warn-dirty = false
      # Automatically optimize store
      auto-optimise-store = true
    '';
  };
}
#+end_src

**** User configuration

#+begin_src nix :tangle modules/common/user.nix
{ pkgs, ... }:

{
  users.users.spacecadet = {
    isNormalUser = true;
    extraGroups = [ "wheel" "lp" ];
    shell = pkgs.zsh;
  };
  home-manager.users.spacecadet = { pkgs, ... }: {
    home.packages = with pkgs; [
      ncspot
      pavucontrol
      blueman
      libreoffice
      firefox
      brave
      gthumb
      nextcloud-client
    ];
    programs.browserpass.enable = true;
    programs.password-store = {
      enable = true;
      package = pkgs.pass.withExtensions (exts: [ exts.pass-otp ]);
    };
    home.file.".icons/default".source = "${pkgs.vanilla-dmz}/share/icons/Vanilla-DMZ";
  };
}
#+end_src

**** Font configuration

#+begin_src nix :tangle modules/common/fonts.nix
{ pkgs, ... }:

{
  fonts = {
    fonts = with pkgs; [
      (nerdfonts.override { fonts = [ "JetBrainsMono" ]; })
      roboto
      twitter-color-emoji
      font-awesome
    ];
    fontconfig = {
      defaultFonts = {
        monospace = [ "JetBrainsMono Nerd Font" ];
        sansSerif = [ "Roboto" ];
        serif     = [ "Roboto" ];
        emoji     = [ "Twitter Color Emoji" ];
      };
    };
  };
}
#+end_src

*** Applications
**** Common

#+begin_src nix :tangle modules/applications/default.nix
{ ... }:

{
  imports = [
    ./firejail.nix
    ./flatpak.nix
    ./media.nix
    ./zathura.nix
    ./calibre.nix
  ];
}

#+end_src
**** Firejail
#+begin_src nix :tangle modules/applications/firejail.nix
{ pkgs, lib, ... }:

{
  programs.firejail.enable = true;
  programs.firejail.wrappedBinaries = {
    thunderbird = {
      executable = "${lib.getBin pkgs.thunderbird}/bin/thunderbird";
      profile = "${pkgs.firejail}/etc/firejail/thunderbird.profile";
    };
    telegram-desktop = {
      executable = "${lib.getBin pkgs.tdesktop}/bin/telegram-desktop";
      profile = "${pkgs.firejail}/etc/firejail/telegram.profile";
    };
  };
  # Firejail-specific desktop shortcuts
  home-manager.users.spacecadet = { pkgs, ... }: {
    xdg.desktopEntries = {
      thunderbird = {
        # Taken from Thunderbird v 91.5.0
        name = "Thunderbird";
        comment = "🦊Firejailed";
        genericName = "Mail Client";
        exec = "thunderbird %U";
        icon = "thunderbird";
        terminal = false;
        mimeType = [ "text/html" "text/xml" "application/xhtml+xml" "application/vnd.mozilla.xul+xml" "x-scheme-handler/http" "x-scheme-handler/https" "x-scheme-handler/ftp" ];
      };
      telegram = {
        # Taken from Telegram v 3.1.11
        name = "Telegram";
        comment = "🦊Firejailed";
        exec = "telegram-desktop -- %u";
        icon = "telegram";
        terminal = false;
        mimeType = [ "x-scheme-handler/tg" ];
      };
    };
  };
}
#+end_src

***** TODO Fix the icons :fix:
**** Flatpak

#+begin_src nix :tangle modules/applications/flatpak.nix
{ ... }:

{
  services.flatpak.enable = true;
  xdg.portal.enable = true;
}

#+end_src
**** Media
#+begin_src nix :tangle modules/applications/media.nix
{ pkgs, ... }:

{
  environment.systemPackages = with pkgs; [
    # Video
    yt-dlp mpv
  ];
  # Configuration files
  environment.etc = {
    # judging by strace, mpv on NixOS expects it in etc.
    "mpv/mpv.conf".text = ''
      hwdec
      save-position-on-quit
    '';
    "mpv/input.conf".text = ''
      WHEEL_UP add volume 5
      # mouse wheel for sound control
      WHEEL_DOWN add volume -5
    '';
  };
}
#+end_src
**** Zathura
#+begin_src nix :tangle modules/applications/zathura.nix
{ ... }:

{
  home-manager.users.spacecadet = { ... }: {
    programs.zathura = {
    enable = true;
    options = {
      # Allows zathura to use system clipboard
      selection-clipboard = "clipboard";
    };
    };
  };
}
#+end_src
**** Calibre

#+begin_src nix :tangle modules/applications/calibre.nix
{ pkgs, ... }:
{
  home-manager.users.spacecadet = { ... }: {
      home.packages = [ pkgs.calibre ];
    };
}
#+end_src

***** CNCL Add mountpoint for the device :feat:
CLOSED: [2023-03-01 Wed 08:22]

*** Development -- for development purposes

