project.org
***** bookmarks

#+begin_src sh :tangle modules/zsh/plugins/bookmarks.zsh
# -*- sh -*-
autoload is-at-least
# Source: https://github.com/vincentbernat/zshrc/blob/master/rc/bookmarks.zsh
# Changed by Vladimir Timofeenko, changed MARKPATH to local share for persistence

# Handle bookmarks. This uses the static named directories feature of
# zsh. Such directories are declared with `hash -d
# name=directory`. Both prompt expansion and completion know how to
# handle them. We populate the hash with directories.
#
# With autocd, you can just type `~-bookmark`. Since this can be
# cumbersome to type, you can also type `@@` and this will be turned
# into `~-` by ZLE.

is-at-least 4.3.12 && () {
    MARKPATH="${HOME}/.local/share/zsh/bookmarks"

    # Add some static entries
    hash -d log=/var/log
    hash -d doc=/usr/share/doc

    # Populate the hash
    for link ($MARKPATH/*(N@)) {
        hash -d -- -${link:t}=${link:A}
    }

    vbe-insert-bookmark() {
        emulate -L zsh
        LBUFFER=${LBUFFER}"~-"
    }
    zle -N vbe-insert-bookmark
    bindkey '@@' vbe-insert-bookmark

    # Manage bookmarks
    bookmark() {
        [[ -d $MARKPATH ]] || mkdir -p $MARKPATH
        if (( $# == 0 )); then
            # When no arguments are provided, just display existing
            # bookmarks
            for link in $MARKPATH/*(N@); do
                local markname=${(%):-%F{green}${link:t}%f}
                local markpath=${(%):-%F{blue}${link:A}%f}
                printf "%-30s → %s\n" $markname $markpath
            done
        else
            # Otherwise, we may want to add a bookmark or delete an
            # existing one.
            local -a delete
            zparseopts -D d=delete
            if (( $+delete[1] )); then
                # With `-d`, we delete an existing bookmark
                command rm $MARKPATH/$1
            else
                # Otherwise, add a bookmark to the current
                # directory. The first argument is the bookmark
                # name. `.` is special and means the bookmark should
                # be named after the current directory.
                local name=$1
                [[ $name == "." ]] && name=${PWD:t}
                ln -s $PWD $MARKPATH/$name
                hash -d -- -${name}=${PWD}
            fi
        fi
    }
}
#+end_src

***** cursor_mode

#+begin_src sh :tangle modules/zsh/plugins/cursor_mode.zsh
cursor_mode() {
    # See https://ttssh2.osdn.jp/manual/4/en/usage/tips/vim.html for cursor shapes
    cursor_block='\e[2 q'

    cursor_beam='\e[6 q'

    function zle-keymap-select {
        if [[ ${KEYMAP} == vicmd ]] ||
            [[ $1 = 'block' ]]; then
            echo -ne $cursor_block
        elif [[ ${KEYMAP} == main ]] ||
            [[ ${KEYMAP} == viins ]] ||
            [[ ${KEYMAP} = '' ]] ||
            [[ $1 = 'beam' ]]; then
            echo -ne $cursor_beam
        fi
    }

    zle-line-init() {
        echo -ne $cursor_beam
    }

    zle -N zle-keymap-select
    zle -N zle-line-init
}

cursor_mode
#+end_src

***** TODO make a minimalistic vim config to edit the shell inline :feat:
- vim-surround
- shell syntax highlighting

**** TODO Rewrite in literal style :doc:

**** DONE Correct the options to use something like ~programs.vt-zsh~ :chore:
CLOSED: [2022-12-25 Sun 19:25]

**** DONE disable gpg if root? :chore:
CLOSED: [2023-02-08 Wed 08:20]

**** DONE Add any-nix-shell :feat:
CLOSED: [2023-02-08 Wed 08:25]
**** DONE Add bat :feat:
CLOSED: [2023-02-08 Wed 08:16]
**** DONE Add killall with an alias :feat:
CLOSED: [2023-02-08 Wed 08:12]

*** Sway

[[https://github.com/VTimofeenko/sway-flake][Original source]]

The sway config has two parts -- the system-wide (greeter and global configuration, implemented using standard nixpkgs settings) and the user-specific (window manager itself, implemented through home-manager)

**** STRT Plan [4/8]
- [X] System-wide settings
- [X] Base settings
- [X] Greeter
  - [X] Write
  - [X] Deploy with zsh
  - [X] Evaluate
- [X] Home-specific settings
- [ ] Replace greeter zsh with sway
- [ ] Xremap base config
- [ ] Revisit packages installed through [home|environment]Packages and see if they can be configured through flake
- [ ] Reusable and centralized keyboard shortcuts

**** System-wide configuration

#+begin_src nix :tangle modules/sway/system/default.nix
{ pkgs, ... }:
{
  imports =
    [
      # ./base-settings.nix
      ./greeter.nix
      ./hyprland.nix
      # ./additional-packages.nix
      # TODO: xremap also goes here
    ];
}
#+end_src

***** Base settings

#+begin_src nix :tangle modules/sway/system/base-settings.nix
{ pkgs, ... }:
{
#+end_src

Despite the fact that sway will be configured through home-manager's options, the [[https://github.com/NixOS/nixpkgs/blob/nixos-22.11/nixos/modules/programs/sway.nix][sway module]] enabled by ~programs.sway.enable~ enables some default configurations.

#+begin_src nix :tangle modules/sway/system/base-settings.nix
  programs.sway.enable = true;
#+end_src

Certain programs (flameshot) also require specific configurations of ~xdg.portal~:

#+begin_src nix :tangle modules/sway/system/base-settings.nix
  xdg.portal =
        {
          enable = true;
          wlr.enable = true;
          extraPortals = [ pkgs.xdg-desktop-portal-gtk ];
        };

#+end_src

#+begin_src nix :tangle modules/sway/system/base-settings.nix
}
#+end_src

***** Hyprland settings

#+begin_src nix :tangle modules/sway/system/hyprland.nix
{ config, pkgs, lib, ...}:
{
  programs.hyprland.enable = true;
  environment.systemPackages = [ pkgs.kitty ]; # BUG: remove later
}
#+end_src

***** Greeter

#+begin_src nix :tangle modules/sway/system/greeter.nix
{ pkgs, lib, config, ... }:
{
#+end_src

I am using [[https://sr.ht/~kennylevinsen/greetd/][greetd]] as the login manager with [[https://github.com/apognu/tuigreet][tuigreet]] for the login screen.

To not break the tuigreet by kernel's logging, [[https://github.com/apognu/tuigreet/issues/17][two settings need to be set]]:

#+begin_src nix :tangle modules/sway/system/greeter.nix
  boot.kernelParams = [ "console=tty1" ];
  services.greetd = {
    enable = true;
    vt = 2;
#+end_src

Now to start the session itself. I prefer to have all logs managed by systemd, thus sway will be started in a ~systemd-cat~ wrapper.

#+begin_src nix :tangle modules/sway/system/greeter.nix
    settings = {
      default_session =
        let
          sway-launcher = pkgs.writeShellScript "sway-launcher" ''
            exec systemd-cat --identifier=sway ${pkgs.sway}/bin/sway ${if (config.networking.hostName == "neptunium") then "--unsupported-gpu" else ""}
          '';
        in
        {
          # taken from https://github.com/apognu/tuigreet
          # command = "${pkgs.greetd.tuigreet}/bin/tuigreet --time --cmd ${sway-launcher}";
          command = "${pkgs.greetd.tuigreet}/bin/tuigreet --time --cmd ${pkgs.zsh}/bin/zsh";
          user = "greeter";
        };
    };
  };
}

#+end_src

****** TODO theme tuigreet :to_think:

****** TODO Add zsh as an alternative session :feat:

According to ~tuigreet~ [[https://github.com/apognu/tuigreet][doc]]:

#+begin_quote
The available sessions are fetched from desktop files in /usr/share/xsessions and /usr/share/wayland-sessions. If you want to provide custom directories, you can set the --sessions arguments with a colon-separated list of directories for tuigreet to fetch session definitions some other place.
#+end_quote

Since I am not using the sessions directly, it may be worth declaring sessions for zsh and sway and manually creating two desktop files.

****** TODO Make CMD human-readable :feat:

See "zsh as an alternative session", the name of the session in the list may be taken from the file

*** Steam

#+begin_src nix :tangle modules/steam/default.nix
{ pkgs, ... }:
{
  # From gamescope PR
  nixpkgs.config.packageOverrides = pkgs: {
    steam = pkgs.steam.override {
      extraPkgs = pkgs: with pkgs; [
        xorg.libXcursor
        xorg.libXi
        xorg.libXinerama
        xorg.libXScrnSaver
        libpng
        libpulseaudio
        libvorbis
        stdenv.cc.cc.lib
        libkrb5
        keyutils
      ];
    };
  };
  environment.systemPackages = with pkgs; [ steam gamescope ];
  # Steam needs this, otherwise there's an error Assertion Failed: Error: glXChooseVisual failed
  hardware.opengl.driSupport32Bit = true;
  environment.variables = {
    WLR_NO_HARDWARE_CURSORS = "1";
  };
}
#+end_src

** Hosts

*** Uranium

This is an 11th gen Frame.work laptop.

**** Modules

***** Default
#+begin_src nix :tangle hosts/uranium/default.nix
{ config, pkgs, lib, ... }:

{
  imports = [
    ./frame.work.nix
  ];
  # Use the systemd-boot EFI boot loader.
  boot.loader.systemd-boot.enable = true;
  boot.loader.efi.canTouchEfiVariables = true;
  boot.tmpOnTmpfs = true;
  boot.tmpOnTmpfsSize = "8G";
  # Modules I want to ensure are there
  boot.initrd.availableKernelModules = [ "thunderbolt" "nvme" "usb_storage" "uas" ];
  boot.initrd.kernelModules = [ ];
  boot.kernelModules = [ "kvm-intel" "coretemp" ];
  boot.extraModulePackages = [ ];
  # Frame.work needs latest kernel for BT and Wi-Fi to work.
  boot.kernelPackages = pkgs.linuxPackages_latest;

  networking.hostName = "uranium";
  networking.useDHCP = false;

  fileSystems."/" =
    {
      device = "/dev/disk/by-uuid/cbaf293c-c8dc-4586-ba65-73cff3f24468";
      fsType = "ext4";
    };
  boot.initrd.luks.gpgSupport = true;

  boot.initrd.luks.devices."luks".device = "/dev/disk/by-uuid/c2e5cd09-b5d7-42cb-a78a-f549edfa0eb4";

  fileSystems."/boot" =
    {
      device = "/dev/disk/by-uuid/028E-BC0A";
      fsType = "vfat";
    };

  swapDevices = [ ];

  # This node was created in 21.11 days
  system.stateVersion = "21.11";

  # For brightness control
  users.users.spacecadet.extraGroups = [ "video" ];
  # bluetooth
  hardware.bluetooth.enable = true;
  services.blueman.enable = true;
  # pipewire config, from https://nixos.wiki/wiki/PipeWire
  security.rtkit.enable = true;
  services.pipewire = {
    enable = true;
    alsa.enable = true;
    alsa.support32Bit = true;
    pulse.enable = true;
    # If you want to use JACK applications, uncomment this
    #jack.enable = true;

    # use the example session manager (no others are packaged yet so this is enabled by default,
    # no need to redefine it in your config for now)
    #media-session.enable = true;
    media-session.config.bluez-monitor.rules = [
      {
        # Matches all cards
        matches = [{ "device.name" = "~bluez_card.*"; }];
        actions = {
          "update-props" = {
            "bluez5.reconnect-profiles" = [ "hfp_hf" "hsp_hs" "a2dp_sink" ];
            # mSBC is not expected to work on all headset + adapter combinations.
            "bluez5.msbc-support" = true;
            # SBC-XQ is not expected to work on all headset + adapter combinations.
            "bluez5.sbc-xq-support" = true;
          };
        };
      }
      {
        matches = [
          # Matches all sources
          { "node.name" = "~bluez_input.*"; }
          # Matches all outputs
          { "node.name" = "~bluez_output.*"; }
        ];
        actions = {
          "node.pause-on-idle" = false;
        };
      }
    ];
  };
  # battery management
  powerManagement = {
    enable = true;
    powertop.enable = true;
    cpuFreqGovernor = lib.mkDefault "powersave";
  };
  services.tlp = {
    enable = true;
    settings = {
        CPU_BOOST_ON_AC = 1;
        CPU_BOOST_ON_BAT = 0;
        CPU_SCALING_GOVERNOR_ON_AC = "performance";
        CPU_SCALING_GOVERNOR_ON_BAT = "powersave";
    };
  };
  # temperature management
  services.thermald.enable = true;
  environment.etc."sysconfig/lm_sensors".text = ''
    # Generated by sensors-detect on Mon Jan  3 23:34:14 2022
    # This file is sourced by /etc/init.d/lm_sensors and defines the modules to
    # be loaded/unloaded.
    #
    # The format of this file is a shell script that simply defines variables:
    # HWMON_MODULES for hardware monitoring driver modules, and optionally
    # BUS_MODULES for any required bus driver module (for example for I2C or SPI).

    HWMON_MODULES="coretemp"
  '';
  # Instead of archwiki, frame.work forums recommend this with s2idle

  # Hardware acceleration
  # Taken from https://nixos.wiki/wiki/Accelerated_Video_Playback
  nixpkgs.config.packageOverrides = pkgs: {
    vaapiIntel = pkgs.vaapiIntel.override { enableHybridCodec = true; };
  };
  hardware.opengl = {
    enable = true;
    extraPackages = with pkgs; [
      intel-media-driver # LIBVA_DRIVER_NAME=iHD
      vaapiIntel # LIBVA_DRIVER_NAME=i965 (older but works better for Firefox/Chromium)
      vaapiVdpau
      libvdpau-va-gl
    ];
  };
  services.fwupd = {
    enable = true;
    extraRemotes = [ "lvfs-testing" ];
  };
  environment.etc."fwupd/uefi_capsule.conf".text = lib.mkForce ''
    [uefi_capsule]
    OverrideESPMountPoint=/boot
    DisableCapsuleUpdateOnDisk=true
  '';
  # NOTE: fwupdmgr uses this to check the boot
  services.udisks2.enable = true;
  # NOTE: Wireless config is here for now, until refactoring of default.nix is done
  systemd.network.links."10-wifi-lan" = {
    matchConfig.PermanentMACAddress = "f8:b5:4d:d7:16:53";
    linkConfig.Name = "wifi-lan";
  };
}
#+end_src

